bash-completion
build-essential
chromium-browser
curl
dconf-cli
devscripts
fastfetch
ffmpeg
fortune-mod
fortunes-off
gconf-editor
gdebi
git
python3-pip
ripgrep
starship
synaptic
tmux
unar
unrar
