# run `brew bundle dump --force` to regenerate this list

tap "homebrew/bundle"
tap "homebrew/cask-versions"

brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "ctags"
brew "curl"
brew "dockutil"
brew "ffmpeg"
brew "fortune"
brew "fswatch"
brew "git"
brew "go"
brew "mas"
brew "neofetch"
brew "node@22"
brew "openssl@1.1"
brew "rbenv"
brew "ripgrep"
brew "socat"
brew "sphinx-doc"
brew "tmux"
brew "unar"
brew "vim"
brew "watchman" # https://github.com/facebook/jest/issues/1767
brew "yarn"
brew "youtube-dl"
cask "barrier"
cask "beardedspice"
cask "ckb-next"
cask "discord"
cask "dropbox"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-source-code-pro"
cask "google-chrome"
cask "hyper"
cask "iterm2"
cask "itsycal"
cask "menumeters"
cask "mixxx"
cask "slack"
cask "spectacle"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "virtualbox"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "vlc"
cask "webpack-dashboard"

mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "Helium", id: 1054607607
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835

vscode "compulim.vscode-clock"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "hoovercj.vscode-power-mode"
vscode "ibm.output-colorizer"
vscode "icrawl.discord-vscode"
vscode "johnpapa.vscode-peacock"
vscode "kamikillerto.vscode-colorize"
vscode "max-ss.cyberpunk"
vscode "ms-vscode.js-debug"
vscode "ms-vscode.live-server"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "mutantdino.resourcemonitor"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "ryu1kn.partial-diff"
vscode "stylelint.vscode-stylelint"
vscode "webrender.synthwave-x-fluoromachine"
